In [1]:
import pandas as pd
#Loading our dataset using read_csv function of pandas
df = pd.read_csv('Housing_Data.csv')
#Inspecting the first 10 rows of the dataset
df.head(10)

,price_lac,area_sqft,bhk,bathrooms,balconies,floors,furnishing_type,location,property_type
0,20.0,560.0,1,2.0,1,6,Unfurnished,Brahmavar,Apartment
1,20.0,600.0,1,1.0,1,4,Unfurnished,Doddanagudde,Apartment
2,20.0,600.0,1,1.0,1,4,Unfurnished,Doddanagudde,Apartment
3,12.0,605.0,2,2.0,1,4,Semi furnished,Indrali,Apartment
4,15.0,605.0,2,2.0,1,4,Semi furnished,Indrali,Apartment
5,19.0,605.0,2,2.0,0,1,Unfurnished,Indrali,Apartment
6,17.0,612.0,2,NaN,0,3,NaN,Indrali,Apartment
7,16.0,620.0,2,2.0,0,1,Furnished,Indrali,Apartment
8,12.0,650.0,2,2.0,1,4,Semi furnished,Indrali,Apartment
9,20.0,650.0,2,2.0,1,4,Semi furnished,Indrali,Apartment

In [2]:
print(df.isnull().sum())

price_lac          0
area_sqft          2
bhk                0
bathrooms          3
balconies          0
floors             0
furnishing_type    2
location           0
property_type      0
dtype: int64

In [3]:
#We replace missing values of bathrooms column with mode as it is a categorical variable
df['bathrooms'].fillna(df.bathrooms.mode()[0],inplace=True)
#We replace missing values of area_sqft column with mode as it is a numerical variable
df['area_sqft'].fillna(df.area_sqft.mean(),inplace=True)
#We replace missing values of furnishing_type column with mode as it is a categorical variable
df['furnishing_type'].fillna(df.furnishing_type.mode()[0],inplace=True)

In [4]:
#Function to describe the dataset with basic summary statistics
df.describe()
#To include categorical variables in the output 
#df.describe(include = 'all')

        price_lac    area_sqft        bhk  bathrooms  balconies     floors
count   94.000000    94.000000  94.000000  94.000000  94.000000  94.000000
mean    56.486277  1908.065217   2.446809   2.244681   1.127660   3.882979
std     38.841617  1467.322738   0.862816   0.799007   0.870472   2.816451
min     12.000000   560.000000   1.000000   1.000000   0.000000   1.000000
25%     31.000000  1000.000000   2.000000   2.000000   0.000000   2.000000
50%     48.000000  1460.000000   2.000000   2.000000   1.000000   3.000000
75%     63.000000  2344.500000   3.000000   2.000000   2.000000   5.000000
max    180.000000  8720.000000   5.000000   5.000000   3.000000  12.000000

In [5]:
#MEAN - The average value of the variable, calculated as the sum of all values divided by the number of values
mean_price = df.price_lac.mean()
print(mean_price)
#Output = 56.48

56.486276595744684

In [6]:
#MODE - The most frequent value of the variable.
mode_price = df.price_lac.mode()[0]
print(mode_price)
#Output = 55

55.0

In [7]:
#MEDIAN - The middle value of the variable when sorted 
median_price = df.price_lac.median()
print(median_price)
#Output = 48

48.0

In [8]:
#RANGE - The difference between the maximum and minimum values of a variable
range_price = df.price_lac.max() - df.price_lac.min()
print(range_price)
#Output = 81000

168.0

In [9]:
#InterQuartile Range(IQR) - The difference between the 75th and 25th percentile values.
#We import iqr function from scipy stats to calculate iqr value for the variable
from scipy.stats import iqr
iqr_price = iqr(df.price_lac)
print(iqr_price)
#Output = 32

32.0

In [10]:
#Variance - The average of the squared distance from each data point to the mean
var_price_lac = df.price_lac.var()
print(var_price_lac)
#Output = 1508.67

1508.6712343742852

In [11]:
#Standard deviation - Square root of variance
stddev_price_lac = df.price_lac.std()
print(stddev_price_lac)
#Output = 38.84

38.84161729864354

In [12]:
import pandas as pd
df_house = pd.read_csv('housing.csv')

In [13]:
df_house.ocean_proximity.value_counts()

<1H OCEAN     9136
INLAND        6551
NEAR OCEAN    2658
NEAR BAY      2290
ISLAND           5
Name: ocean_proximity, dtype: int64

In [14]:
df_house.ocean_proximity.value_counts()

df_house_1hocean = df_house[df_house.ocean_proximity == 'NEAR OCEAN']
df_house_inland = df_house[df_house.ocean_proximity == 'NEAR BAY']

In [15]:
df_house['median_house_value'].mean()

206855.81690891474

In [16]:
from scipy.stats import ttest_1samp
import numpy as np

#applying the function for one sample t test to obtain p value
tstat, pval = ttest_1samp(df_house.median_house_value, 786700)
print(f'the resulting p-value for the one sample t-test is {pval}')

the resulting p-value for the one sample t-test is 0.0

In [17]:
df_house_1hocean = df_house[df_house.ocean_proximity == 'NEAR OCEAN']
df_house_inland = df_house[df_house.ocean_proximity == 'NEAR BAY']

from scipy.stats import ttest_ind
import numpy as np

#applying two sample t test function
tstat, pval = ttest_ind(df_house_1hocean.median_house_value, df_house_inland.median_house_value)
print(f'the resulting p-value for the two sample t-test is {pval}')

the resulting p-value for the two sample t-test is 0.00518433462827199

In [18]:
df = pd.read_csv('toy_dataset.csv')

In [19]:
contingency = pd.crosstab(df.City, df.Gender)

In [20]:
from scipy.stats import chi2_contingency

#creating contingency table for the variables city and gender
contingency_table = pd.crosstab(df.City, df.Gender)

#applying chi square function to obtain p value by passing contingency table to the function
res = chi2_contingency(contingency_table)
print(f'the resulting p-value for the chi square test is {res.pvalue}')

the resulting p-value for the chi square test is 0.5812220214510175